In [360]:
pip install mysqlclient

Requirement already satisfied: mysqlclient in c:\users\angeline.zanela\anaconda3\lib\site-packages (2.0.3)Note: you may need to restart the kernel to use updated packages.

In [361]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\angeline.zanela\anaconda3\lib\site-packages (2.9.1)
Note: you may need to restart the kernel to use updated packages.

In [362]:
import pandas as pd

In [363]:
df1 = pd.read_csv("db.transactions.csv")
df2 = df1
df2.head(5)

,step,customer,age,gender,zipcodeOri,merchant,zipMerchant,category,amount,fraud
0,0,'C1093826151','4','M','28007','M348934600','28007','es_transportation',4.55,0
1,0,'C352968107','2','M','28007','M348934600','28007','es_transportation',39.68,0
2,0,'C2054744914','4','F','28007','M1823072687','28007','es_transportation',26.89,0
3,0,'C1760612790','3','M','28007','M348934600','28007','es_transportation',17.25,0
4,0,'C757503768','5','M','28007','M348934600','28007','es_transportation',35.72,0

In [364]:
#ID INCREMENTAL
df2 = df2.assign(id=[0 + i for i in range(len(df2))])[['id'] + df2.columns.tolist()]

In [365]:
df2.head(10)
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 594643 entries, 0 to 594642
Data columns (total 11 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           594643 non-null  int64
 1   step         594643 non-null  int64
 2   customer     594643 non-null  object
 3   age          594643 non-null  object
 4   gender       594643 non-null  object
 5   zipcodeOri   594643 non-null  object
 6   merchant     594643 non-null  object
 7   zipMerchant  594643 non-null  object
 8   category     594643 non-null  object
 9   amount       594643 non-null  float64
 10  fraud        594643 non-null  int64
dtypes: float64(1), int64(3), object(7)
memory usage: 49.9+ MB

In [366]:
#remove as aspas simples
#coluna age
df2["age"] = df2["age"].map(lambda x: str(x).replace("'",""))

In [367]:
#remove o U
df2["age"] = df2["age"].replace(["U"], None)

In [368]:
#converte string para int
df2["age"] = df2["age"].astype(int)

In [369]:
df2.head(10)
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 594643 entries, 0 to 594642
Data columns (total 11 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           594643 non-null  int64
 1   step         594643 non-null  int64
 2   customer     594643 non-null  object
 3   age          594643 non-null  int32
 4   gender       594643 non-null  object
 5   zipcodeOri   594643 non-null  object
 6   merchant     594643 non-null  object
 7   zipMerchant  594643 non-null  object
 8   category     594643 non-null  object
 9   amount       594643 non-null  float64
 10  fraud        594643 non-null  int64
dtypes: float64(1), int32(1), int64(3), object(6)
memory usage: 47.6+ MB

In [370]:
#remove as aspas simples
df2["gender"] = df2["gender"].map(lambda x: str(x).replace("'",""))
#substitui as letras por NaN
df2["gender"] = df2["gender"].replace(["U", "E"], np.nan)

In [371]:
#Criar coluna mÃªs: 
  #      step 0 a 30 = 1
  #      step 31 a 60 = 2
  #      step 61 a 90 = 3
  #      step 91 a 120 = 4
  #      step 121 a 150 = 5
  #      step 151 a 180 = 6

df2.loc[(df2["step"] <= 30), "mes"] = "01"
df2.loc[(df2["step"] >  30)  & (df2["step"] <= 60),  "mes"] = "02"
df2.loc[(df2["step"] >  60)  & (df2["step"] <= 90),  "mes"] = "03"
df2.loc[(df2["step"] >  90)  & (df2["step"] <= 120), "mes"] = "04"
df2.loc[(df2["step"] >  120) & (df2["step"] <= 150), "mes"] = "05"
df2.loc[(df2["step"] >  150) & (df2["step"] <= 180), "mes"] = "06"

In [372]:
df2["mes"]

0         01
1         01
2         01
3         01
4         01
          ..
594638    06
594639    06
594640    06
594641    06
594642    06
Name: mes, Length: 594643, dtype: object

In [373]:
#cria coluna ano
#df2 = df2.drop("ano", 1)
df2["ano"] = "2021"

In [374]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 594643 entries, 0 to 594642
Data columns (total 13 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           594643 non-null  int64
 1   step         594643 non-null  int64
 2   customer     594643 non-null  object
 3   age          594643 non-null  int32
 4   gender       592950 non-null  object
 5   zipcodeOri   594643 non-null  object
 6   merchant     594643 non-null  object
 7   zipMerchant  594643 non-null  object
 8   category     594643 non-null  object
 9   amount       594643 non-null  float64
 10  fraud        594643 non-null  int64
 11  mes          594643 non-null  object
 12  ano          594643 non-null  object
dtypes: float64(1), int32(1), int64(3), object(8)
memory usage: 56.7+ MB

In [375]:
#coluna dia
df2["dia"] = "01"

In [376]:
df2.head(5)

,id,step,customer,age,gender,zipcodeOri,merchant,zipMerchant,category,amount,fraud,mes,ano,dia
0,0,0,'C1093826151',4,M,'28007','M348934600','28007','es_transportation',4.55,0,01,2021,01
1,1,0,'C352968107',2,M,'28007','M348934600','28007','es_transportation',39.68,0,01,2021,01
2,2,0,'C2054744914',4,F,'28007','M1823072687','28007','es_transportation',26.89,0,01,2021,01
3,3,0,'C1760612790',3,M,'28007','M348934600','28007','es_transportation',17.25,0,01,2021,01
4,4,0,'C757503768',5,M,'28007','M348934600','28007','es_transportation',35.72,0,01,2021,01